Revit 2027 API
Rebar.FreeFormAlignedServerGuid Property
 Guid used for identifying the external IRebarUpdateServer for computing Aligned Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid FreeFormAlignedServerGuid { get; }
Public Shared ReadOnly Property FreeFormAlignedServerGuid As Guid
	Get
public:
static property Guid FreeFormAlignedServerGuid {
	Guid get ();
}
static member FreeFormAlignedServerGuid : Guid with get
Property Value
Guid
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace